---
project: ks
topic: 大人の学び方
topic_code: lrn
title: 40歳という折り返しの年齢をきっかけに学び直す決意をする
subtitle: "\U0001F393002 「昔取った杵柄」で40年は働けない"
description: null
url: 'https://knowledgestuck.substack.com/p/learn-002'
date_published: 2024-02-28T00:00:00.000Z
audience: everyone
tags:
  - 学び
draft_link: null
series_name: 大人の学び
series_emoji: "\U0001F4AD"
series_code: learning
---

## メモ・原稿

`= this.file.frontmatter.url`

```dataview
LIST
FROM #ks/🎓 
WHERE file.day <= this.file.day - dur(1 d)
SORT file.day DESC
LIMIT 1
```
```dataview
LIST
FROM #ks/🎓 
WHERE file.day >= this.file.day + dur(1 d)
SORT file.day ASC
LIMIT 10
```


---

大人の勉強をテーマにした連載の第2回です。

これまで書いた記事一覧はこちらから→[🎓大人の趣味としての学び - ごりゅご.com](https://goryugo.com/otonashumi-theory)

前回は主に「感情」的な部分で、なぜ勉強をしようと考えるようになったのか、というのをまとめました。今回はもう少し未来のことを考えて、なぜ勉強が必要だと感じたのか。これについてまとめようと思います。

## 勉強への新たな動機

勉強に対する『やる気』が出たため、ごりゅごはさらに自分を説得するための材料を集めることにしました。

その中で、自分にとって一番強い根拠と感じられたのは「働く期間が延びる」という点です。医療の発達で人間の平均余命が大きく延びることで、これからの世代はどんどん「働く期間」が長くなっていくことは決定的です。それを踏まえるとどうしても「若い頃の知識」だけでは無理が出てきてしまう。

そこが「学ぶ」理由です。

## 変化の大きな高齢化社会は「昔取った杵柄」だけでは通用しなくなる時がくる

一世代ちょっと前の日本のサラリーマンは、仕事を60まで勤め上げればそれで「あがり」でした。その後は年金をもらいながら、悠々自適な余生を過ごして人生を終える。

このイメージが事実かどうかはさておき、日本の年金システムはこうした考えが前提になって作られていました。そして、この仕組みは様々な社会的要因から歪みが大きくなり、年金がもらえる時期も、金額も、どんどん少なくなることは確定的になってきています。

2024年現在、60歳で引退するつもりの人、引退できると思っている人、または引退しようと思っている人は、おそらくほとんど存在しないでしょう。

^1: 現代では逆にこうした時代だからこそなのかFIREを目指す人が増えている感じですが、個人的にはこの生き方もかなり危ういのではないか、と考えています。そこは今回の主題ではないので掘り下げません。


現在43歳のごりゅごは、一般的なサラリーマンの働き方とは異なりますが、80になっても90になっても何らかの形で仕事は続けていると思うし、働き続けたいとも思っています。そして、ごりゅごと同じような感覚の人もきっと多くいると考えています。

60歳で引退することを前提にした生き方と、80歳まで働くことを前提にした生き方の「期間」がどのくらい違うのか。大雑把で雑な計算ですが、だいたいこんな感じになりました。

学校などで勉強するのが20歳までだと考えてみると、60歳で引退する人は「20年で学んだことで40年間生き抜く」という計算。80歳で引退する場合は「20年で学んだことで60年間生き抜く」ことが必要になります。

もちろんこれは「仕事をして自然に身に付けたスキル」などは一切計算に入れていない、大雑把で雑な計算です。

ただ、この「学んだ期間と働く期間」を数字にして比較してみると、なんていうか「ああ、これはこのままではたぶん無理やな」と思ってしまったんですよね。

若い頃20年学んだ知識だけで、50年も60年も通用するとかはさすがに無理。というか、20歳から60歳までうまくやっていくだけでも難しいやん、と。

自分が何冊か本を読んだだけの分野でも、遺伝子治療だとかAI、複雑系ネットワークなど、どれも自分が学生時代には事実上「存在していなかった学問分野」です。あと20年30年経てば、まだまだ完全に新しい分野がいくらでもでてくることは、ほぼ間違いないでしょう。

それに対して今の自分は、20年くらい前に自力で学んだコンピュータの知識と、20年くらい続けてきたWebで生きてきたという経験値。そのくらいのものしかないし、この10年ほどは、そうした知識や経験すらほとんどアップデートされている感覚がありませんでした。

さらに、かつては「絶対忘れない」くらいに思ってた学校の勉強も、かなりの部分を忘れて、わからなくなっている。

学校の勉強ができなくなることで仕事に支障が出るかといえば、すくなくとも表面上はなにも変化はありません。ただ、こうやって「だんだんできなくなっている感覚」であと30年とか40年とか生きていくというのは、とてもツライ。「できない」ことは苦にならないけど「できなくなっていく」という感覚を持ったままでは、明るく楽しく生きていくことが困難になる。

こうした状態のままで20年間を過ごしてしまうと、きっと自分は自分が嫌いなタイプの大人になってしまう。それは、出来る限り避けたい。

## 折り返しの40歳

今振り返ると、こういうことを考えた時に40歳という年齢がすごくちょうどよかったんですよね。

人生を80年だと考えると、40歳はちょうど折り返しの年齢で、残りは半分。また、大人になったのが20歳だとすると、40歳はちょうど大人になってから20年が経過した期間。大人として、大人になったと言える年齢でもある。

これをちょうどいい区切りの期間だと考えて、基本的な生き方、考え方を少し変えてみてもいいんじゃないか。

そんな風に思い立って、1年か2年くらい勉強することをできる限り優先するという「大人の受験期間」と名付けた生き方をしてみようと思い立ちました。

5年も10年も必死こいて勉強するなんてことはできないけど、1年か2年くらいならば受験生の時の気分を思いだせば「それなりに頑張る」ことならできるんじゃないか。

もちろん、もう大人なので「勉強しかしない」なんて生き方は不可能ですが、無理ない範囲で、可能な限り色々なことを学んでみる。1年か2年くらい「学ぶ」ということの優先順位を上げてみる。そんなことをしてみてもいいんじゃないか。

そしてその期間に、ある程度「学ぶ能力」を身に付けておけば、あとは「それなり」でうまくやっていけるのではないか。

ここでもごりゅごは天然でポジティブで、ちゃんと「賢い勉強」ができれば、一番すごい人にはなれなくても、けっこうすごい大人にはなれるはず、と思い込むことができます。

天狗になってはいけないが、自信を持ち続けることは重要です。そうやって自信を持って「学んでるんだ」満足感と「成長している」という感覚。これがあれば1年2年くらいならかなり楽しめるはず。


## 新しい学びかたが超面白い

で、ここからはもうほんとに運が良かったという言い方になるんですが、ちょうど興味を持った「Obsidian」というツールが、とにかく「新しい勉強の仕方を学ぶツール」として非常に素晴らしいものだったのです。

今どきの新しいノートツールを使って、自分自身の学び方を学びながら、試行錯誤を繰り返す。これが超楽しい。

どうやって学ぶといいのか、ということ自体が科学の世界で研究が進み、それらの情報はその辺の書店で売ってる本にたくさんまとめられている。

そうやって学んだ内容を、忘れないようにする方法もいっぱい見つかるし、忘れないようにするためのツールも充実している。

主なツールはAnkiとObsidianなんですが、これらを使って「上手に学べている感覚」というのがものすごく嬉しくて楽しくて、まったくもって苦痛を感じず、様々なことを学び続けることができました。

今現在はこの「学ぶ」という行為の幅が広がって、一番学びたいのは「ギター」になってるんですが、ここでもこれまでに学んできた「学び方」は間違いなく役に立っています。

おそらく一番重要なのは、こうしたことを面白がれるかどうか。

自分は運良く「今どきの勉強の仕方が超進歩してて面白い」と感じることができて、その実践を心の底から楽しむことができました。

きっかけには危機感のようなものはあったけど、根本的には「楽しめる心」こそがもっとも重要だと思います。

では、どうしたら楽しめるのか。

そこには、ごりゅごが「大人の趣味理論」と呼んでいる大人ならではの楽しい学び方というものが存在しています。

次回は、この「大人の趣味理論」についてまとめてみたいと思います。
