---
project: ks
topic:
  - Obsidian
  - Dataview
  - RINKシステム
  - Zettelkasten
  - 知識管理
topic_code: obs
title: ノートを「つなげて」整理するRINKシステム
subtitle: "\U0001F48EObsidian x DataviewでZettelkastenを実践する"
description: >-
  ObsidianとDataviewを用いた新しい整理術「RINKシステム」の導入方法と効果を解説。Zettelkasten的なIDをノート名に付与し、Dataviewで関連ノートを動的に表示させることで、思考の流れを追いやすく、未知の分野もボトムアップで整理できる。今後の課題にも触れています。
url: 'https://knowledgestuck.substack.com/p/rink'
date_published: 2025-06-11T00:00:00.000Z
audience: everyone
cover_image: >-
  https://substackcdn.com/image/fetch/$s_!w2P3!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5835cdb6-e867-46ee-8bc3-fbc5ec877efd_1322x740.png
tags:
  - Obsidian
  - Dataview
draft_link: null
series_name: Obsidian Tips
series_emoji: "\U0001F48E"
series_code: obs
---

## メモ・原稿

```dataview
LIST
WHERE series_order < this.series_order & series = this.series
SORT series_order DESC
LIMIT 5
SORT series_order ASC
```

```dataview
LIST
WHERE series_order > this.series_order & series = this.series
SORT series_order ASC
LIMIT 5
```

> [!NOTE] アイデア
> ```dataview  
>LIST  
>WHERE startswith(file.name, "ks.d")  
>SORT file.name asc  
>LIMIT 5
>```

## RINKとはなにか（導入）

[『アトミック・シンキング』実践セミナー034](https://knowledgestuck.substack.com/p/ks034)で概要を紹介したんですが「RINK」という名前のデジタル的な整理の仕組みを考えました。

RINKという名前は「Relational Index of Networked Knowledge」の頭文字を組み合わせたもの。

あなたのノート・メモ・知識の断片を「つながり」として記録し、あとから自然に**構造化されたネットワーク**として浮かび上がらせるための、**軽量かつ強力なナンバリング手法**です。

（というこじつけストーリーをChatGPTと共に考えました。実際は先に頭文字2つがあり、そこからアイデアを広げて名前と物語を付けた、って感じです）

具体的には、Obsidianと、Obsidianのプラグイン「Dataview」を利用し、ノート名の先頭にZettelkasten的な意味と意図を持ったIDを割り振ることで、自分自身の思考の流れを追いかけやすくしたり、未知の分野での仕事をボトムアップで整理できる、という効果があります。

もっと簡単なことをいうと、Zettelkastenぽい文字列をノートの先頭につけといて、関連するZettelkastenではそれらを全部並べて表示できるようにしたら便利だよね？それがうまくできる方法をごりゅごなりに整理したよ、という感じかな。

下記ページからのリンクなどを辿っていただけると、ああこうやってやるんだな、ということはだいたいご理解いただけるはずです。

[思考の整理ではなく思考を進めるためのZettelkasten](https://knowledgestuck.substack.com/p/zettelkasten-514)

今回は、上記の話を読まなくてもわかるように、超簡単な導入方法と、実際にある程度試してわかった「この仕組みの何がよいのか」みたいなものをまとめてみたいと思います。

## 基本設定とルール

まずは「超簡単なRINKの使い方」から。

必要なのは、ObsidianとDataviewプラグインの2つだけです。

そして「同じかたまりとして整理したいノート名の先頭に、同じパターンで始まる文字列を付ける」というのが実践の際の原則です。

「同じ文字列パターンで始まるノート」のかたまりは、Dataviewを使うと簡単に絞り込みができます。

下記画像は「手動で作ったリンク」なんですが、こんな感じのリンク一覧が、Dataviewを使ったら自動で表示できるよね。これが原則です。
![[スクリーンショット 2025-06-10 18.08.46.png]]

しかもこれ、ノート先頭の文字列を工夫したら、あとから追加したノートでも「途中」に並べることができる。（m.2aと、m.2bの間にm.2aa、というのを追加できる）

「上手に番号を付けてあげると、アルファベット順表示だけでも好きな場所にノートが追加できる」ここがまず最初のポイントです。

いちばん大事なのは「名前のつけ方」を考えることから得られる「思考がつながる感覚」なんですが、今回はそれは置いといて、具体的な実践方法に進みましょう。

Dataviewを使って「ある文字列から始まるノートを表示させる方法」を考えていきます。

具体的には、Dataviewをインストールして、こんな感じの文字列を追加してあげると、その場所に「`m.`から始まるノート」がアルファベット順に並びます。

> [!NOTE] 目次
> ```
>LIST  
>FROM "notes"
>WHERE startswith(file.name, "m.")
>SORT file.name asc  
>```

ちなみにこのテクニックは「Dataview」に「Callout」というテクニックを組み合わせています。

![[スクリーンショット 2025-06-11 11.16.36.png]]

Calloutというテクニックを組み合わせると、`[!NOTE]- 目次`という感じで、閉じ括弧`]`の後ろに-（マイナス）を付けてあげることで、標準でこの目次を「閉じた状態にできる」という特徴があります。

-のところを+にすると、このかたまりが「開閉可能」になります。これは、将来的に「ノートがたくさん」になってきた時に便利な方法になってきます。

## 超シンプルに「好きな範囲のリンクだけ」を表示できる

Dataviewを使った整理の方法が素晴らしいのは「カスタマイズが超簡単」なことです。

上記の`WHERE startswith`の行を見てください。

英語を読むとだいたい内容が想像できると思いますが、これは「ファイル名の先頭が`m.`のノートを表示する」という指示をした文章です。

つまり、この`m.`の部分を自分で別のものに書き換えてあげれば、ある特定の文字列から始まるノートを表示させるのも超簡単にできるんですね。
![[スクリーンショット 2025-06-11 11.17.34.png]]
これ「プログラムのコード」自体はほとんど一緒です。自分が変更するのは「m.」の部分だけ」

画像の例でいうと「m.」のところを「m.2」に変えてあげるとこんな感じになります。

なので、この一連の文字列だけをすぐに呼び出せるようにしておけば「覚えること」も一個だけで済みます。

そして、同じかたまりのノートには、全部この文字列を埋め込んでおく。

そうすれば、ノートが増えてもDataviewが自動でいい感じに「全部のノートへのリンク」を作ってくれます。

そして、なにか「別のかたまり」が見つかったら、新しいグループを作ってあげればいい。

たとえば次は`m.`じゃなくて`o.`みたいな文字で始まるようにしてあげたり、`19.`みたいな数字を使ってもいい。こういうのが全部自由です。

## 範囲の絞り込みも簡単にできる

最初のころは、ノートが少ないので`m.`で始まるノートを全部表示しても、全然邪魔になることはありません。

ただ仮に、同じようなノートが100個くらい集まってくると、さすがに一覧性が悪くなる。ノートが多すぎて邪魔、ってことになってくるかもしれません。

そんな時は、さっきの「`m.`」の部分をもう少し絞り込み範囲を広げる、ということをやってあげればいい。

具体的に言うと、`m.`を`m.0`とかに書き換えてあげれば、そのdataviewでは`m.0`で始まるノートだけを表示する、ということもできるようになります。

ノートの絞り込み範囲は逐次手動で変更する必要がありますが、個人的にこの程度の手間は許容範囲だと考えています。

むしろ、ノートごとに表示する範囲を自分で細かく指定できるのは、いいことの方が多い。

こうやって「シンプルなコード」なおかげで、覚えることが少なく、手間暇少なめで、全体を自分好みにカスタマイズがしやすい。

そんな手軽で便利な仕組みだと思ってます。

## 「特殊な文字列」だから確実に素早く呼び出せる

また、細かな話なんですが、これは「.（ドット）」という「普通のノート名ではあまり出てこない文字列」をノート名の頭の方に持ってくることにも大きな意味があります。

こういう独自性の高いノート名は、Obsidianの「Quick Switcher」（⌘＋Oでノート名からノートを開くやつ）とめちゃくちゃ相性が良いのです。

これにある程度慣れてくるとたとえば「⌘+O, m.00」みたいな感じで、半ば無意識に、身体化された超高速な操作で目的のノートを開くことが可能になってきます。

[![Image from Gyazo](https://i.gyazo.com/7a3014b9af162c7ef2efd1ed39b553c5.gif)](https://gyazo.com/7a3014b9af162c7ef2efd1ed39b553c5)


こういう文字列、1日2日で一気に何個覚えられるものではないんですが、時間と期間をかけて慣れていけば、普段よく使うノートを5〜6個くらいならばコンマ数秒、たまに使う10〜20個くらいのノートならば数秒くらい、というレベルでささっと呼び出せるようになります。

コツは、一気に増やしすぎないことや、自分なりの「覚えやすい工夫」ですが、まあそういうのは追々考えていけばいいでしょう。

ポイントは「同じかたまりのノートは同じ文字列で始める」ことと、ノート全部に「Dataviewのリンク」を書いておくこと。

これさえできれば、ひとまずは「シンプルに使いはじめることができる」

はず。


## 現時点での課題（問題点）

とは言え、現段階でもこの手法にはいろいろ課題を感じている、というのも事実です。

細かなことはひとまず置いといて、現段階で明確に欠点と言えるのが「ノートのタイトルが長すぎて超気持ち悪い感じになる」（と思う人が多くいそう。だから、初見の人にこれを進めるのがめちゃくちゃ難しくなるかもしれない）ということ。


![[スクリーンショット 2025-06-11 11.11.24.png]]

困ったことに、この「長い文字列」っていうのがこの「RINK」という手法の核とも言える部分なので、今のところこれを表示しないでどうにかする、という方法は考えられない。

現段階でここまで紹介してきたこと以外にも、いろいろな工夫は思いついてはいるんですが、それでもこの「先頭7〜8桁についてくる文字列が気になる人」にはこの手法は向いてなさそうなんですよねえ。

実際にこのあたりはどうしていこうかはこれから考えていきたいところでもあります。


とりあえず今考えているのは、上記のような課題があることを認識した上で、同時に「やる気があるうちにやれることをやる」なんじゃないかと思いました。

問題は問題として認識した上で、今の自分が整理できてる限りのことを、言語化して整理し、手法として公開していく。

これによって自分の考えもまとまるし、他の人からのリアクションや質問から、より考えが深まっていく可能性も出てくる。

なので、これからしばらくは主にこの話題を中心にしていろいろと考えを進めていきたいと思っています。
