---
project: ks
topic: 振り返り
topic_code: rev
title: オンラインオフ会のルールに込めた思いとゲスト投稿から得られる多様な視点について
subtitle: "\U0001F4C5004 月一のまとめ＆ショートコンテンツも少しずつ慣れてきました"
description: null
url: 'https://knowledgestuck.substack.com/p/4fb'
date_published: 2022-11-30T00:00:00.000Z
audience: everyone
draft_link: null
series_name: その他
series_emoji: "\U0001F4C5"
series_code: other
category: 振り返り
---

## メモ・原稿

#ks/📅 `= this.file.frontmatter.url`

```dataview
LIST
FROM #ks/📅
WHERE file.day <= this.file.day - dur(1 d)
SORT file.day DESC
LIMIT 1
```
```dataview
LIST
FROM #ks/📅
WHERE file.day >= this.file.day + dur(1 d)
SORT file.day ASC
LIMIT 1
```

2022年11月のごりゅごの主な活動と、今後の予定などを報告します。

## 今月の主な活動（ナレッジスタック）

今月は「Obsidian仕事術」というテーマを思いつき、その具体的な方法を模索しながら言語化することがメインの一ヶ月でした。

具体的にまずは、iPhoneやMacからすぐに「デイリーノート」に追記できるようにするためのショートカットの作成を作成し、公開。

[デイリーノートに追記、デイリーノートをワンタップで開く2つのショートカット](https://knowledgestuck.substack.com/p/2)

そしてもう一つが、Obsidianで「一つのタスクを一つのノート」方式を実践してから「やること」をいい感じに整理するために、Dataviewを使った事例をいくつか紹介しました。

[Obsidian Dataviewを使って同じタグの前後の記事へのリンクを作る](https://knowledgestuck.substack.com/p/obsidian-dataview)

[ObsidianのDataviewで「ホーム画面」「デイリーノート」を改善する](https://knowledgestuck.substack.com/p/obsidiandataview)

そして、ナレッジスタック第3回目のセミナーは「Obsidianの使い方のおさらい」をテーマに開催。

[『アトミック・シンキング』実践セミナー3動画アーカイブ](https://knowledgestuck.substack.com/p/seminar003)

その他、以前リクエストいただいた「Gitの設定」の話。

[MacやWindowsのObsidianデータをGitHub経由でiPhoneと同期する](https://knowledgestuck.substack.com/p/macwindowsobsidiangithubiphone)

また「インボックス論」をきっかけにして書いたObsidianの「インボックス」をどう使うのか、と言う話も書きました。

[Obsidianに破綻しないGTDインボックスの仕組みを作る](https://knowledgestuck.substack.com/p/obsidian-gtd)

---

### オンラインのオフ会

もう一つ新しい試みとして、11月5日にいわゆる「オフ会」というやつを開催しました。Zoomで開催している時点で全然"オフ会"じゃないけどオフ会と呼びます。オンラインオフ会です。

一般的なジャンルとしては「オンライン飲み会」に分類されるものですが、少しだけルールを設定しています。

ただ普通に集まってしゃべるのではなく「みんなが知らなさそうなおもしろいもの」をテーマに各人が順番に「おもしろいもの」について語っていく、という形式です。

[みんなが知らなさそうなおもしろいものを紹介する会議](https://knowledgestuck.substack.com/p/2d9)

こういう形式を選択しているのには、複数の理由があります。

まずなによりも、ルールを決めておくことで初対面の人同士でも「話すこと」がきちんと見つかること。それぞれが「話すこと」を準備してきて順番に話すというルールは、みんなが遠慮して話ができなくて困る、みたいなのを防ぐ目的もあります。

さらにこれはオンラインで集まる時の弱点を解消できる方式ではないか、とも考えています。

たとえばリアルで20人や30人の人間が集まれば、大抵は複数のグループができます。二人や三人ではグループが分かれることはまずありませんが、5人6人集まればもうそれぞれ「話題が合う人同士」でグループができるのが普通。

それに対し、Zoomなどで集まる場合は「グループに分かれる」ことは簡単にはできません。

Zoomはその対策としてランダムにグループをわける機能を作ったり、他のサービスでは「場所移動ができる」なんてサービスも存在したりしますが、自分はどれもまだ「不便」を感じる仕組みだと思います。

そんな無理して不便な機能を使うくらいならば「運用」でカバーしよう。その運用方法というのが「順番に話す」というシステムというわけです。多分10人とか20人くらいならば「順番に話す」という形式で十分に皆が楽しめるのではないか、と考えています。

世の中に「人の話を聞くのが好きな人」が一定数いることは理解できますが、それとは別に「話したいことはある。だが声のでかい人に全部話を持っていかれる」という不満を抱える自分と同じような人もある程度いるはず。

個人的にこの「声のでかい人ばかりが話している環境」というのは好きではありません。「自分がイベントを主催する」というのは仕切りやすくすることでそれを抑制することはできますが、きちんとルールを決めてしまえばほとんど課題は解決します。

そして多分、声のでかい人だけが話す場所よりも、いろんな人が用意してきたいろんな話が聞けるほうが、最終的に「場全体」も盛り上がると考えています。

前回の会では、ごりゅごは（おそらく普段他人に話す機会がない）アメフトの話をわりと存分に話すことができました。話を聞いてもらえただけでなく、そのことについて（多分興味を持って）質問してもらうことまで体験できました。

まずこれだけで超楽しいわけですよ。飲み会でいきなり「アメフト楽しいから見ようよ」と言い出すのはちょっとキモい、という社会的感覚はありますが、この会は「そういうことを言う場所」です。思う存分「唐突に」「文脈と何も関係ない」好きな話を語っていいのです。

みんな「話を聞くつもり」で参加してるから、どんな話でも受け入れてもらえます。

そしてそういう場所のおかげで、まあ普段は聞けないようなレアな話がいっぱい聞けるわけですよ。

音声データが膨大すぎて映画館でしか上映できない（ディスク化されない）映画のリバイバルの話だったり、京都に渋い銭湯がいっぱいあるという話（これからどんどんなくなっていってしまう可能性が高い）。ラジオというコンテンツの楽しみ方や、Wordのマクロ（Excelではない）でどんなことができるかという話。睡眠をサポートしてくれる「ロボット枕」なんてものや、そんなんできるのかというGoogle検索の小技。オトナなゲームの話や分割キーボードの話などなど。

どれも多分、自分が普通に生活していたらまず聞くことができない話ばかり。そして、どの話も話す人が「面白い」と思ってることなので、質問も盛り上がります。

「面白いと思ってることを話せる」「面白いと思ってる話を聞いてもらえる」

これはきっと、日常生活ではなかなか体験できない貴重な空間です。これは今後も定期的に開催したいと強く思ったのでありました。（次回は12月10日（土）21時〜に開催します）

---

もう一つ、今月から新しく「ゲスト投稿」を始めました。

[デイリーノートから始めるObsidian - by 魚住惇⌨️『教師のiPad仕事術』 - ナレッジスタック](https://knowledgestuck.substack.com/p/obsidian-4d2)

気がつけばすでに出会って10年くらい経過したジュン先生に、月に一回「Obsidianとデイリーノート」というテーマで記事を書いていただく予定です。

かつては「フラペ先生」と呼ばれていたのに、今はそれがまったく通じなくなってしまって悲しい。

ナレッジスタックでは、デジタルノートやアトミック・シンキングの話、それと関係するObsidianの使い方などをメインテーマにして記事をお届けしていますが、ごりゅご一人で提供できるものは「ごりゅごの使い方」だけになってしまいます。

それはそれで悪くないというか、そうやってごりゅごに興味を持っていただけることはうれしいんですが、人間は人それぞれ趣味趣向、好みは少しずつ異なるものです。ごりゅごがどんなに素晴らしいと思う方法でも、他の人には「合わない」可能性は常に存在します。

ごりゅごのやり方はあくまでも「参考情報」で、それを自分なりにカスタマイズして取り入れてほしい、と思っています。

そして、カスタマイズをするときに「他の人のやり方」を知ることが役立ちます。

おそらくジュン先生とごりゅごは、二人ともObsidianを使っているという時点で「大きな好み」は似ています。

でも、普段Obsidianに書いていることはちょっと違う。

ごりゅごの記事やセミナーから影響を受けている部分はあるみたいですが、いい意味で「自分に合わない方法は取り入れない。自分なりのやり方で使っている」という印象があります。

それを知ることはきっと「自分なりのやり方」を考えるときに参考になるはずです。

こうやっていろいろな人の事例が紹介できれば、ナレッジスタックという一つの媒体で提供できる情報の幅が広がるはず。

ちょうど次回公開予定の原稿を送っていただいたところなんですが、お願いしてた量の倍くらいの分量に倍くらいの熱意が込められておりました。

個人的にも今後が楽しみです。

---

## これまでのセミナー動画アーカイブ


- [『アトミック・シンキング』実践セミナー動画アーカイブ](https://knowledgestuck.substack.com/p/216)
- [『アトミック・シンキング』実践セミナー2動画アーカイブ](https://knowledgestuck.substack.com/p/seminar002)
- [『アトミック・シンキング』実践セミナー3動画アーカイブ](https://knowledgestuck.substack.com/p/seminar003)


## 今後のスケジュール（確定分）

- 12月10日（土）21時〜 オフ会2回目（Zoom）
- 12月17日（土）21時〜 第4回セミナー：ObsidianとAnki（Obsidian学習術001）
- 1月7日（土）21時〜 第5回セミナー：1年の計はObsidianにあり（仮）

なお、2023年からは（基本的に）第2、第4土曜日にセミナー、オフ会を開催していく予定です。

また、それとは別にAnkiの設定、ショートカット.appの設定なんかは、ワークショップのようなものを開催できたらいいかも、みたいなことも考えてます。
