---
project: ks
topic: 振り返り
topic_code: rev
title: Live PreviewをオフにするとObsidianは軽い
subtitle: "\U0001F4C5012 iPadではObsidianのLive Previewを使わなくなった"
description: null
url: 'https://knowledgestuck.substack.com/p/w012'
date_published: 2023-06-16T00:00:00.000Z
audience: everyone
cover_image: >-
  https://substackcdn.com/image/fetch/$s_!_uyX!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff54a4eee-8a38-45f1-ba92-3019b4dab902_1400x810.png
tags:
  - Obsidian
draft_link: null
series_name: その他
series_emoji: "\U0001F4C5"
series_code: other
category: 振り返り
---

## メモ・原稿

#ks/📅  `= this.file.frontmatter.url`

```dataview
LIST
FROM #ks/📅 
WHERE file.day <= this.file.day - dur(1 d)
SORT file.day DESC
LIMIT 1
```
```dataview
LIST
FROM #ks/📅 
WHERE file.day >= this.file.day + dur(1 d)
SORT file.day ASC
LIMIT 1
```


2週間に1回くらいをめどにお届けする予定の「週刊ナレッジスタック」的な雑記コンテンツです。

セミナーのお知らせや、1記事になりきらないけど面白いもの、結論をきちんと言語化できてないけど興味深いと思ってることなどを紹介します。


---

[『アトミック・シンキング』実践セミナー10](https://knowledgestuck.substack.com/p/ks010)の内容を、しゅんさんがめっちゃいい感じに手書きでまとめてくれました。

https://twitter.com/plzsayyes3/status/1664983310584659969?s=20

セミナーは有料会員の方向けのものなんですが、内容についてこうやって発信していただけるのは大歓迎です。書いてある内容も見事で、自分とは違った観点で内容が整理がされていて興味深いです。また、純粋に自分が喋ったことをこういう風にまとめていただけるのは超嬉しいです。

すべてのナレッジスタックの有料コンテンツは、中身をそのままコピペする、という方法以外であれば、どんな形で使っていただいても問題ありません。（問題ないというか、嬉しいです）

ごりゅごが書いた文章なども、全文まるっとコピペする、という形でなければ、いくらでもなんにでも使ってください。引用歓迎です。


---

## Live PreviewをオフにするとObsidianは軽い

最近はiPadでObsidianを使う頻度が増えて、そしてiPadのObsidianがしょっちゅう固まる、という問題に悩まされていました。これ、ひょっとしてObsidian SyncじゃなくてiCloudで同期することが原因かなあなんてことを考えていたんですが、どうも（自分が使っている環境での）原因はLive Previewをオンにしていることだったようです。

これでものすごく軽くなった、最高！というほどのものではないんですが、まあそんなに問題なく普通に使えるようになった、というくらいにはなりました。

誰にでもオススメできる方法、というわけではないんですが、iPadのObsidianが重すぎてつらい、と感じている方は試してみてもいいかもしれません。


---

## 登録してくれている人が増えてきてありがとう

2022年の9月に始めたナレッジスタックの有料プランが、今年度に入ったくらいから加入してくださる方が増えてきています。（ありがそうございます）

![[2023-06-12_16.21.13ss.png]]

正直、まだこれだけで生活できるというレベルではないんですが、このペースで登録してくださる人が増え、それがあと何年か継続できればでこれだけで生きていくということもできそうな雰囲気になってきました。

改めて思うんですが、こういった（おそらくかなりニッチな）コンテンツは、基本的に広告と相性が悪いです。そうしたニッチなコンテンツを提供して広告で生活していこうとすると、できるだけマスにリーチできるようにした（個人的に全然おもしろくない）コンテンツを書いて読者の幅を広げ、煽りが強いタイトルを付けてできるだけ多くの人に見てもらう、というような努力が必要になります。

自分が「ブログで生活」してた頃も、できるだけそういう「おもしろくない」ことをしたくないと思いながら、なんだかんだそうやって「金になること」にも力を入れていたのも事実です。そうした状況からの脱却に向けてこのニュースレターを始めて数年。ようやく広告で生きることからの脱却に目処が立ってきたというのは、新たなる人生の節目のようにも感じます。

もちろん、広告が絶対悪であると決めつけるほど潔癖でもないし、100％読者の利益のみに人生を捧げる、みたいなことを偉そうに言えるほどの聖人君子でもありません。自分がいいと思ったものがAmazonで売ってれば、Amazonのアフィリエイトリンクは普通に使います。そういうのをゼロにしようとは思いません。

また、できるだけ広告に頼らずお金を稼ごうとする場合でも、結局資本主義社会で人並みに生きていくためになんらかの「お金にする努力」は必要で、そうすると結局できるだけ多くの人にリーチするための努力が不要になるわけではありません。

それでも、今のやり方はこれまでよりもずっとより多くの時間を「興味深い内容を届ける」ことに使えるようになってきています。できるだけ「金になること」じゃなくて「自分と同じような興味や趣味の人に役立つと思ってもらえること」を書くようにしていて、それが今のところ間違っていないと思える結果が出てくるようになってきています。

生きてる限り「金になること」と「役に立つこと」のバランスをどうするのかという矛盾や葛藤をゼロにすることはできないと思いますが、結局それらは自分自身で受け入れて生きていくしかありません。それでも、できるかぎり誠実に活動していくことがきちんと成果につながるであろう期待が持てるようになったということは、今後よりよいコンテンツを作ることに集中するためにも大変素晴らしい希望です。

基本的に自分ができることは「自分はこういうことをしてすごく便利だったから参考にしてみてね」ということだけですが、今後もできるかぎりそれを言語化して、多くの人に役立つものとして届けられるように努力していきたいと思っています。


---

セミナー・イベントの予定

ナレッジスタックセミナー11回
7月8日（土）21:00〜
いつもと予定が違います。2週目の土曜日に開催します。


ナレッジスタックセミナー12回
8月5日（土）21:00〜
通常通り、第一土曜日の開催です。
