---
project: ks
topic_code: obs
title: Obsidianで最初に重視するのはデイリーノート
subtitle: "\U0001F48E003 デイリーノートを100日間がっつり使ってみる"
description: Obsidianのデイリーノートを活用し、ギター練習の計画と記録を通じて上達を実感し、モチベーションを維持する方法を解説。テンプレート改善に注力し、整理よりも実践を重視。
url: 'https://knowledgestuck.substack.com/p/obsidian003'
date_published: 2023-06-06T00:00:00.000Z
audience: everyone
tags:
  - Obsidian
  - デイリーノート
draft_link: null
series_name: Obsidian Tips
series_emoji: "💎"
series_code: obs
topic: ['Obsidian', 'デイリーノート', '習慣化']
---

## メモ・原稿

`= this.file.frontmatter.url`

```dataview
LIST
FROM #ks/💎
WHERE file.day <= this.file.day - dur(1 d)
SORT file.day DESC
LIMIT 1
```
```dataview
LIST
FROM #ks/💎
WHERE file.day >= this.file.day + dur(1 d)
SORT file.day ASC
LIMIT 1
```

[💎ゼロから始めるObsidian ](https://publish.obsidian.md/knowledgestack/obsidian_restart)シリーズ第3回です。

前回は、ボトムアップでの整理の重要性について書きました。すごく乱暴にまとめれば、ノートが100個もないような段階では整理なんか考えない方がいい、という内容のものでした。

とは言え、実際にノートを「使っていく」ためには、なんの整理もせずにノートが機能するという訳でもありません。

そもそもごりゅごが新しくObsidianの保管庫を作った目的は「ギター練習に役立てる」ことです。なんらかの方法で「使っていく」ことができるようにする工夫は必要です。ノートを整理していない段階で、どうやってそれを機能させるのか。

そこで活躍するのが「デイリーノート」です。

## 漫画『ベイビーステップ』のように上達を目指す

いったん話が遡るんですが、そもそも「ノートを役立てる」というのはどういうことを意味するものなのか。今ごりゅごがイメージしている「練習ノート」は、テニス漫画『[ベイビーステップ](https://amzn.to/42dRaBP)』の主人公「エーちゃん」が使っているノートです。

漫画の中でのエーちゃんは、相手がどんなプレーをしてきたのか、それに対してどういう対策が考えられるのかなどを試合の合間にノートを使って書いて考えて、それを活かして戦っていきます。作中でそんなことをする選手は当然主人公だけなんですが、彼はこうやって「勉強力」を武器にしてテニスの世界でのし上がっていきます。

特に興味深いのは、普通は小学生中学生から始めないと大成しないと考えられているテニスの世界の中で、高校からテニスを始めてプロを目指す「遅咲きの物語」でもあるというところ。ここにもシンパシーを感じます。

ごりゅごも、学生時代にギター弾いてた経験はあるっちゃあるけど、そこから20年もなにもしていなかった「40代での初心者からのスタート」です。こんな「今更」とも言えるような年齢からでも、ベイビーステップと同じように「勉強力」を活用してギターを練習したらどんなことができるのか。

おそらくギターを練習する人で「まじめにノートつけて練習する人」はそこまで多くないはず。それを、自分の「勉強力」「デジタルノート力」を使って、遅咲きでもこれだけ上達できるんだぞ、っていうのを証明したい。そういうのも自分のモチベーションになっていたりします。

## デイリーノートに練習計画と練習記録を残す

では具体的に、練習ノートをどうやって使っていくのか。ベイビーステップの中では、ノートが出てくのは主に試合中です。そこに書かれる内容は主に「相手がどんなことをしてきたか」「それにどう対応するか」という記録です。「ギター練習に役立てる」目的に置いて、そっくりそのままあてはめて使うことはできません。

ごりゅごが実践している方法は、Obsidianのデイリーノートを「練習計画表」として活用しつつ、同時に「練習記録」として活用していくというもの。テニスと違って相手が存在しない方法なので、向き合うのはひたすら自分です。

「自分がどんなことをしたのか」「それに対して今後はどういうことをしていくのか」それを計画して、実践して、記録する。そしてそれを翌日以降に役立てていく。

それを実行する手段が、デイリーノートです。デイリーノートのテンプレートに「練習計画」を立てて、日々のデイリーノートにどんなことを練習したのかを記録していきます。

これ、きちんと練習記録を残して一ヶ月程度なんですが、すでに相当興味深いんですよ。

今の自分がすごく未熟なのも理由の一つですが、今はほんの1週間でめちゃめちゃ上手になってるのが記録を見るだけですごくよくわかるんですよ。以前は全然できないと思ってたことが、今やってみるとすごくあたり前に、簡単にできる。

自分の実感としては、何日も練習してるけど昨日となにも変わらない。まだまだ全然できないなー、って感じなんですが、記録を振り返ると「マジか！1週間前はもっと全然できてないのか！確かに確実に上達してるやん」ということがよくわかります

こうやって確実に上達が実感できるおかげで、毎日「やればうまくなるから練習したい」と思えるようになるんですよね。これはモチベーション管理にものすごく役立っています。うまくなってることがわかるから練習したくなって、練習をするからうまくなる。ちょっとうまく記録すると、こんなにいい感じにやる気がキープできるのか、と驚いています。

（具体的にどんな計画や記録を残しているのかについては、[『アトミック・シンキング』実践セミナー10動画アーカイブ](https://knowledgestuck.substack.com/p/ks010)からご覧いただけます）

これを実現する上で、とにかく重要なのはデイリーノートのテンプレートです。毎日繰り返したい練習は、デイリーノートのテンプレートに書く。新しい課題が見えてくれば、それもテンプレートに書いておく。

デイリーノートテンプレートは「一度作ったらおしまい」ではありません。気になること、やりたいことはテンプレートにさえ書いておけば、毎日確実にデイリーノートに出てきます。

そして、デイリーノートはしばらくの間は整理しません。なにが書いてあるかわからないものは、わかるように修正するけど、それ以上の整理はなし。ノートの整理に時間を使うかわりに、デイリーノートのテンプレートを改善することにひたすら注力していきます。

（テンプレートの改善の中には「毎日の練習内容を考える」という要素も含まれています。飽きないためにどういう練習をしたらいいのか日々考える。これもまたかなり重要なことではないかと考えているんですが、そこはまた後日考えたいと思います）

なんなら「毎日テンプレートを修正する」くらいの心がけでデイリーノートの改善を行い、同時にデイリーノートにはどんなことでもいいからどんどん気になったことを書き込んで、きちんと記録を残していきます。

## 「仕事じゃない」からこそ真剣にやる

自分が若い頃は「趣味」であるギターの練習に、そんなマジメでめんどくさいことをするなんてことは想像すらできませんでした。ただ、趣味だからといってめんどくさいことをしたらいけないなんてわけはないし、むしろ**趣味だからこそどれだけ手間暇をかけても自由なはずです。**そしてそれが最終的に「楽しい」ものになるのであれば、そんな素晴らしいことはありません。

趣味だからこそダラダラやるのではなく、本気でやれることをやる。その方が結局人生は充実して楽しいものになります。これはある程度年齢を重ねて理解できるようになってきたことですが、一定程度真理であることは確信しています。

もちろんこの「デイリーノートで練習を進める」というObsidianの使い方は仕事に使っても便利だと思いますが、それよりも「真剣になれること」からはじめて、その知見を仕事にも活かしていく、という感覚の方がうまくいくのかもしれません。

仕事に真剣になれるならばそれは素晴らしいことだろうし、逆に「真剣になれる趣味がない」のであれば、そうした真剣になれることを見つけるためにObsidianを活用するというアプローチもあるでしょう。

「まずはノート整理よりデイリーノート」

デジタルノートの使い方に悩んでいるならば、まずこの方法を試してみることをオススメします。
