---
project: ks
topic: その他
topic_code: misc
title: Logseqでの作業日誌の残し方
subtitle: "\U0001F914\U0001F4AD002 アウトラインで残す作業記録は一覧性が高い"
description: null
url: 'https://knowledgestuck.substack.com/p/atom002-logseq'
date_published: 2022-09-15T00:00:00.000Z
audience: only_paid
cover_image: >-
  https://substackcdn.com/image/fetch/$s_!UtcY!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F13ac6db0-555c-4617-9c5a-0f3709cc28dd_910x1658.jpeg
draft_link: null
series_name: アトミックシンキング
series_emoji: "\U0001F914"
series_code: atomic
category: 入門
---

## メモ・原稿

#ks/🤔💭 `= this.file.frontmatter.url`

```dataview
LIST
FROM #ks/🤔💭
WHERE file.day <= this.file.day - dur(1 d)
SORT file.day DESC
LIMIT 1
```
```dataview
LIST
FROM #ks/🤔💭
WHERE file.day >= this.file.day + dur(1 d)
SORT file.day ASC
LIMIT 1
```
```dataview
LIST
FROM #🗣プレゼン/2022 
WHERE file.day <= this.file.day - dur(1 d)
SORT file.day DESC
LIMIT 1
```

# ATOM002 Logseqでの作業日誌の残し方

[ATOM001 ノートをアトミックにして保存する実践例 ](https://knowledgestuck.substack.com/p/atom001)のつづきです。

LogseqやDayOne、Obsidianに具体的にどういう形でどういうノートを残しているのか。「アトミックノート作りの前段階」としてそれぞれ順番に紹介しようと思っているんですが、たぶん一番多くの人に役に立つのがLogseqに作業日誌を残す、という方法です。

ノート型のリンクツールはいろいろありますが、作業日誌を残すという用途においては、ObsidianよりもScrapboxよりもLogseqが向いています。（LogseqとRoam Researchは「ほぼ同じ機能」なので、今回の話はLogseqをRoam Researchに置き換えても通じる）

## アウトラインで残す作業記録は一覧性が高い

Logseqが作業日誌に向いている一番の理由は「リンク」したものの一覧性の高さ。Logseqでは、特定の単語を`[[リンク]]`で囲むことで新しいページが作られます。そして、そのページの一番下に、同じ`[[リンク]]`を含むノートが一覧でずらっと並びます。

たとえばこれは、ナレッジスタックの作業日誌の最下部。（ksという略語を割当てている）
![[2022-09-14_17.20.46ss.jpeg]]

Logseqの「デイリーページ」には、このような形で記録を残しています。
![[2022-09-14_17.22.58ss.jpeg]]

`🔖[[日誌]]`という部分が、半リアルタイムで書いている「作業日誌」の部分です。今ちょうど、ナレッジスタックの原稿を書いているので、`[[ks]]`と書いたところ。これを書くのが一段落ついたら「どういうことをやったのか」を記録します。

ここで、Logseqが素晴らしいのは「アウトラインで記録が出来る」こと。最初の行は「見やすさ」「わかりやすさ」を考えて、適切なタイトルを意識しますが、それ以降はどれだけたくさん書いても「閉じればいい」

多めの情報量と、全体の把握のしやすさを両立できてしまうのはアウトライナーというツールの素晴らしさです。

なお、Logseqは設定ファイルで「どのレベルまで開いた状態を標準にするのか」を自由に選べます。

`config.edn`の以下のパラメータを変更すればOK（上の行は「何段階まで開くか」で、これをゼロにすると一行目だけが見える。下の行は、標準で何行以下なら最初から関連リンクをひらん他常体にするのか、というもの。ログの数が増えると読み込みが重くなるので、そのバランスをとるためのもの）
```
 :ref/default-open-blocks-level 2
 :ref/linked-references-collapsed-threshold 50
```

今はこれを、上の行は1、下の行は100にしてます。このあたりをいろいろ調整して、自分好みのパラメーターを見つけてやると、もう一段階Logseqが使いやすくなります。

## ページ自体に情報を残しリンクで作業記録が残る

もちろん、作業日誌だけでなく「ページ」にも記録を残しておくことが可能です。これは「日誌」というよりは、そのページはどういうページなのか、というような残しておきたい情報を置いておくのにいい感じです。

たとえば`[[ks]]`というページの中に「これはどんなページなのか」という説明だったり、普段どういうことをやっているのか、どういう目的でこの仕事を行っているのか、ということを書いておくこともできるし、どんなことを書こうと思っているのか、という「ネタ帳」としても使えます。

また、このページに「スケジュール」を組み合わせてリピート設定などをしてやると、簡単なタスク管理としても使えます。（リクエストがあればLogseqのリピートとタスクの話も書きます）

実際のページ「ks」はこんな感じです。
![[2022-09-14_18.43.50ss.jpeg]]
最上部ではエイリアス（別名）を設定するための行。
次の行では「毎週やること」を繰り返しタスクにしています。（今は週1更新ではないから必要ないな、ということに今気がつく）

個人的には↑のように個別のページ部分はあんまり使っていないんですが、知らなくてやらないのと、知っててやらないことは意味が違います。やろうと思えば結構いろんなことに使えるかも、くらいのイメージで覚えておくといいかもしれません。

## ちゃんとできてなくていいけど構造化は目指す

こうした作業ログは、最近は「なにかいつもと違うことをしたら記録に残して」「とりあえずなんかそれっぽいリンクを付けておく」ということを意識しています。

1週間前くらいは「アウトプットと関連する記録のみ残す」だけだったんですが、やってみると大して手間がかからないどころか、むしろやった方が仕事が捗る、気分がよくなる、というのもあって記録が増えてます。

`[[git]]`で新しいことを試してみたことを記録してたり、`[[obsidian]]`の使い方をちょっと変えてみたことや、`[[帳簿]]`付けをやったログとか。基本的にいつもと違うことはとりあえずなにか名前を付けて、カッコで囲って記録を残す。

この`[[名前]]`は「完璧」を目指すとつらいので、1回しか使わなかったりしてもいいし、途中で名前変えてわからなくなってもいい。とりあえずしばらくそういう「失敗」は気にせず、記録を残してみてどのくらい役に立つのか見極めてみよう、というくらいの距離感です。

`[[リンク]]`も1行に1個しか書いてはいけない、というルールもないので`[[obsidian]][git]] Obsidianの同期にgitを使うようにした`なんて書き方も可能です。

こうした記録は、特に「不定期」で繰り返す仕事や、一定期間間があくような仕事があるときに本当に役に立ちます。1週間前までやってた「本の続き」を書こうとすると、本当に簡単に「この前どこまでやったっけ？」になります。

土日はさんで月曜日になるだけでもう「この前どこまでやったっけ？」になるし、なんなら昨日のことでも「昨日どこまでやったっけ？」になるわけです。

確定申告は、毎年必ず以前のノートを見て、それを見ながら「やり方」を確認しています。

Logseqは「記録を残す」ことで（たとえば確定申告の）手順書の素材を残すことができ、その素材を使って実際の手順書を簡単に作り上げることができるようになります。

そのためにも、まずはいろいろな記録を「日誌」として残してみる。

自分も、Logseqのおかげでようやく「いろんな仕事」で日誌を残すということができるようになりました。
