---
project: ks
topic: ['Obsidian', '思考法', '効率化']
topic_code: obs
title: "センスがないことをObsidianを使って補う"
subtitle: "\U0001F48Eスキルをいかに言語化してObsidianで整理していくか"
description: Obsidianを活用し、ギターなどの身体的スキルを言語化・整理。センスに頼らず、意識的な学習と試行錯誤で上達を促進する具体的な方法と、ノート整理の重要性を解説。
url: 'https://knowledgestuck.substack.com/p/obsidian-016'
date_published: 2024-03-16T00:00:00.000Z
audience: only_paid
cover_image: >-
  https://substackcdn.com/image/fetch/$s_!StbT!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd2d858dc-4978-4192-9fc8-1c977315a7b9_1448x2596.jpeg
tags: []
draft_link: null
series_name: ""
series_emoji: ""
series_code: obs
---

## メモ・原稿

`= this.file.frontmatter.url`

```dataview
LIST
FROM #ks/💎
WHERE file.day <= this.file.day - dur(1 d)
SORT file.day DESC
LIMIT 1
```
```dataview
LIST
FROM #ks/💎
WHERE file.day >= this.file.day + dur(1 d)
SORT file.day ASC
LIMIT 1
```

シリーズをやめて、Obsidianに関する話はもうこの絵文字で行きます。自分用の管理だけです。

次は、[💎ゼロから始めるObsidian ](https://publish.obsidian.md/knowledgestack/obsidian_restart)シリーズ第12回です。


---

[📋ナレッジスタックの記事一覧 - ごりゅご.com](https://goryugo.com/ks_all_post)を更新する

→[[📋ナレッジスタックの記事一覧]]



# Obsidianを使って身体的スキルを言語化して学ぶ

[Obsidianを使って身体的スキルを言語化して学ぶ](https://knowledgestuck.substack.com/p/obsidian-484)という記事で「スキル」を言語化してObsidianでまとめることについて最近よく考えている、という話を書きました。

最近ようやくこのあたりの話を整理できそうになってきたので、それについてまとめてみようと思います。

## がむしゃらな練習は「丸暗記」と同じでなにも残らない


今ごりゅごがObsidianを使って実践しているのは「ギターの上達にObsidianを役立てる」という話です。大きな意味で言えば、デジタルツールをスキル習得のために役立てる、というイメージでしょうか。

最近自分がよく考えているのは、どんなスキルでも「がむしゃらに練習するだけでは効果が低い」というもの。だから「ただ真似をするだけでなく常に様々なことを考えながら練習することが重要」なんです。

20年前のごりゅごにとって、ギターの練習とは「なにも考えずに楽譜に書かれていることをなぞる」という行為を意味していました。おそらく、音楽的センスに優れた人は、この「コピー」から自然とある程度のことを学び取り、無意識のうちにスキルを身につけていけるのでしょう。ただ、残念ながら私は音楽に関しては凡人でした。

なにも考えずに曲をコピーしていても、できることはその曲をそれっぽく演奏できるだけで、一切応用も利かず、丸暗記したことを忘れてしまえばなにも残らない。まさによくある「勉強が不得意な人の典型」みたいなことをやっていました。大人になって学ぶ力を身に付けた私は、そこから一歩進み、常に考えながら練習をする、というところにまではなんとか辿り着けたのです。

## 「センス」を勉強の能力でカバーする

そんな中で、ギターについて学べば学ぶほどわかってきたのは「ギターがうまくなる」ためには「ギターを弾く」以外にも重要なことがめっちゃいっぱいある、ということでした。

たとえばそれは、聴いた音をきちんと解像度高く聞き取れたり、自分の音を客観的に把握できるような「耳」の能力。覚えたフレーズなどを忘れないようにしたり、応用できるようにするための「分析」の能力など。

つまり、自分がやりたい、やろうとしていることというのは、一昔前ならば「センス」という言葉で片付けられてしまっていたようなことを、可能な限り言語化をして、自分のような「センスが足りない」人間が身に付けられるようにしていくのか、ということ。言い換えれば、自分が得意なアプローチから、不得意な分野にも寄せていこうと考えているわけです。


## Obsidianでどうやって学んでいくのか

ここからは、上記の目的を達成するために、どうやってObsidianを使っていったのか、という話です。

大雑把にやったことというのを言語化すると、まずはいっぱいノートを作って、それらを思いつく限りの範囲でトピックノートにまとめる、ということです。

「究極の理想的状態」を考えるのであれば、たとえば「ギターが上手になる」とはなにを意味しているのか。自分の場合なにをもってしてギターが上手だといえるのか。そういうところがきちんと言語化ができるようになることです。それができていれば、迷うことなく、上手にノートを作ることができるのかもしれません。

ただ、そういうことがわからないから、ノートを作って整理するのです。「ギターが上手になるためには何をしたらいいか」がわかった状態というのは、すでにもうかなり上手になっている段階なわけです。

どんなことを練習すれば「うまくなる」のかがわかってれば、うまくなるに決まってるわけで、それがわからんから、ノートを作って試行錯誤するしかない。

わかったことは、そうやって「たくさんやってみて、たくさん失敗して、少しずつよい方法を見つけ出していくしかない」ということ。ノートが整理できるようになっていく過程こそが、脳内が整理できていくということであり、ギターが上達できているということでもあるのです。

下手なノート、役に立たないノートをいっぱい作って、それを踏まえて「自分に役立つもの」を少しずつ見つけていくことが「うまくなる」ことなのだと。

ここで難しいのは、Obsidianというツールに慣れていないと、スキル習得の試行錯誤と同時に、Obsidianの使い方自体も試行錯誤して身に付ける必要がある、ということです。

なので、個人的には、まずはObsidianを使って何かを整理するというスキルを身につけることが重要だと考えています。

とは言え、いきなりそれを言われても、そううまくはできない。

ごりゅごが考える第一歩は、手前味噌ながら『アトミック・シンキング』を読んでいただくことだと思っています。

そして次は、たくさん試行錯誤することなんですが、そう理想的なことばっかり言ってられるほど、世の中の人々に時間が有り余っているわけでもありません。

なのでここからは（あくまでも参考事例でしかないんですが）ごりゅごが実際にObsidianどんなノートを作っていったのか。

これまでに作って失敗してきたノートなどを踏まえつつ、今現在はどんな状態になっているのか、というのを簡単に紹介したいと思います。

以降、具体的なノートのサンプルと、それについての説明など。

## 「よく使うもの」をまとめるのが一番Obsidian的で便利

現在最も役立っているのは、「よく使うノート」をまとめた「🎸ギター練習」というノートです。

今までにたくさんのノートを作ってきましたが、なんだかんだ一番役に立つのがこうした「よく使うものだけをリンクでまとめる」という用途。

これが一番「Obsidian的」な使い方で、一番「役に立つ」使い方だと思います。

結局のところ、どれだけたくさんノートを作ろうが「使うもの」だけすぐに使えるようにしておけば、これだけで十分便利です。


今現在、自分はどういうことを練習しているのか、みたいなのをまとめている感じです。なのでこれは、時間経過と共にどんどん変わっていっています。


![[guitar-practice.jpeg]]

これ以外に、Obsidianのデイリーノートに「ギター練習記録」を残してるんですが「この項目を練習した」というのをコピペするための素材となるページでもあります。


たとえばデイリーノートはこんな感じ。

![[65425AC1-C0E0-413D-8B00-24F7EFABCBDA_1_201_a.jpeg]]
## 様々な観点で試しているノート達

その他、🎸ギター練習のノートからリンクされているノートの実例をいくつか。

![[codetone.jpeg]]

このノートは、全般的に「自分で計画を立てて、どういうことをやろうと思ってるか」を書きながら整理していっている、というもの。練習計画を立てるためのノート、みたいなイメージかな。


かつての「🎸ギター練習」のノートは楽譜へのリンクがたくさんあったんですが、今はそういうのは「メモ帳アプリ」と「紙」に整理して、練習する時に使ってる、という感じです。

それらの「マスターデータ」はObsidianで管理している、という感じかな。

たとえばこのノートは、そういうマスターデータ管理用のノート。

![[yamadajazz.jpeg]]


その中で「今よく使ってるノート」というのはメモ帳アプリの中にも重複して存在します。

![[memo.jpeg]]






ここまでが、今現在よく使ってて、役に立ってるObsidianのノート達。

これより先は、失敗した（あんまり役に立ってない）ものだとか、まだ役に立つかわからないけど取りあえず実験として作ってみてるノート達です。

たとえば、特定の「ギタリスト」に焦点を当ててまとめたノート。その人の代表作にリンクしたり、その人について研究された楽譜だったり、まだどういうことをまとめたらよいのかは模索中です。（そもそも、こういうノートは必要かどうかもまだわからない。趣味として実験している、というもの）


![[burney.jpeg]]



これ以外にも、同じように「ジャズスタンダード」についても同じようなノートを作って見ています。

これも、どういう観点でまとめるとよいのか、そもそもこういったノートがあると役に立つのかはわからない段階ですが、思いついたことは色々やってみよう、という精神。


![[kareha.jpeg]]


[abc記法](https://goryugo.com/abc_1st_tutorial)を使ってメロディを書いてみたり、コード進行だとかを整理してみたり。










![[kareha2.png]]




こういうノートを作る時に気をつけないといけないのは、ノートをたくさん集めることを「目的化」しないようにすること。たとえば「スタンダード曲全部集めてみよう」だとか「有名なギタリストのノート100個作ろう」とかってことをやろうとすると、ほぼ確実に目的を見失います。

目的は「ギターが上手になること」であって「ギターデータベースが充実すること」ではありません。

作るノートは、とりあえが今自分が練習してる曲だけ、今参考にしているギタリストだけ。少しずつ少しずつノートを作るだけにとどめておくこと。そういうことを続けていって、**ノートが自然に増えていったならば、そうしたノートは高い確率で「役に立つノート」に育っていきます**。

## 言語化しづらいことを言語にして整理

他にも、これもまだ効果は未知数ですが「テクニックの言語化・構造化」を試みたノートなんかもあります。

![[tech.jpeg]]

これも、abc記法を使って楽譜にしたものや、純粋な「知識の言語化」を試みたノートなど、色々あります。

こういうノートは、最近よく話している「作っていく過程」が重要なノートだと考えています。知識を言語化して、どこに当てはめてあげるといいのかを考えて、整理していくことで、自分の頭の中が整理されていく、というタイプ。だから、いきなり完成形を与えられても意味がないもの、とも言えるのかな。

自分自身で、演奏のアイデアやテクニックにどんなものがあるのかを考えて、それを学んだら、言語化して整理していく。これを繰り返していくことでスキルの身体化に役立つのではないか。そんな考えです。

## 「やりたいリスト」は作らない方がいい

関連した失敗として「いつか練習しようと思って貯めといた楽譜」みたいなのがあったりします。

たとえば（もうリンク先のノートは消したんだけど）雑誌にのってて「いつかやれたらいいな」とか思って集めた楽譜たち。

![[guitarmagazine.jpeg]]


同じように「いつか練習するかもしれないな」とか思って残しておいた動画リンク。

![[debby.jpeg]]



決して、こういうコンテンツが悪い、といっているわけではありません。悪いのは「やりもしないのにいつかやろう」と思ってただ無駄に集めて残しておこうとする精神。

GTDで言う「いつかやりたいことリスト」というのはデジタルツールを使う場合にはない方がいいんじゃないか、というのがさいきんのごりゅごの見解です。

こんなん、ただ増えるだけで、やりもせず「やれてない」という感覚が増えるだけです。それよりも、少しのことを無意識にできるようになるまで何回も練習する方がいい。これが現段階での結論。

もちろんこれは程度の問題ではあって、これから練習する項目というのもすべては「やりたいリスト」なので、こうしたノートを完全にゼロにすることは出来ません。

ある程度失敗して、無駄に作りすぎたという経験も、それはそれで重要です。

その辺りは結局のところ、自分自身で手を動かしてやってみるしかない。試してみて、失敗するしかない。

一番知っておくべきことは「失敗するのが普通」だということ。だから失敗しても気にしない。失敗を糧に、上達するしかない。これを知っておくことだと言えるのかもしれません。
